# Titanic Veri Seti Analizi

Bu Ã§alÄ±ÅŸmada, Kaggle'da yer alan Titanic veri seti kullanÄ±larak Ã§eÅŸitli analizler gerÃ§ekleÅŸtirilmiÅŸtir. Titanic yolcularÄ±nÄ±n hayatta kalÄ±p kalmamalarÄ±, yaÅŸ, cinsiyet, bilet sÄ±nÄ±fÄ± ve Ã¼cret gibi demografik ve seyahat bilgileri Ã¼zerinden incelenmiÅŸtir. AÅŸaÄŸÄ±daki yer alan sorulara odaklanarak veriler analiz edilmiÅŸ ve altÄ±nda Python kodlarÄ± ile Ã§Ã¶zÃ¼mler verilmiÅŸtir.

Veri seti hakkÄ±nda detaylÄ± bilgiye aÅŸaÄŸÄ±daki linkten ulaÅŸabilirsiniz:  
ðŸ”— https://www.kaggle.com/c/titanic/data

In [7]:
import pandas as pd
df_titanic = pd.read_csv("Titanic_dataset.csv")

### Veri Setinin Genel Bilgileri

In [14]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Veri Setinin Ä°lk 10 SatÄ±rÄ±

In [15]:
df_titanic.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

### SayÄ±sal DeÄŸiÅŸkenlerin Ä°statistiksel Ã–zeti

In [17]:
df_titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

**1. Kazada Ã¶lenlerin yaÅŸ ortalamasÄ±nÄ± bulunuz.**

In [20]:
df_titanic[df_titanic['Survived'] == 0]['Age'].mean()

30.62617924528302

**2. Kazada Ã¶lenlerin bilet fiyatlarÄ±nÄ±n ortalamasÄ±nÄ± ve medyanÄ±nÄ± bulunuz.**

In [21]:
dead_fare = df_titanic[df_titanic['Survived'] == 0]['Fare']
dead_fare.mean(), dead_fare.median()

(22.117886885245877, 10.5)

**3. Kazada Ã¶len erkeklerin yaÅŸ ortalamasÄ±nÄ± bulunuz.**

In [22]:
df_titanic[(df_titanic['Survived'] == 0) & (df_titanic['Sex'] == 'male')]['Age'].mean()

31.618055555555557

**4. Kazada Ã¶len kadÄ±nlarÄ±n yaÅŸ ortalamasÄ±nÄ± bulunuz.**

In [23]:
df_titanic[(df_titanic['Survived'] == 0) & (df_titanic['Sex'] == 'female')]['Age'].mean()

25.046875

**5. Kazadan kurtulanlarÄ±n yaÅŸ ortalamasÄ±nÄ± bulunuz.**

In [24]:
df_titanic[df_titanic['Survived'] == 1]['Age'].mean()

28.343689655172415

**6. Kazadan kurtulanlarÄ±n bilet fiyatlarÄ±nÄ±n ortalamasÄ±nÄ± bulunuz.**

In [25]:
df_titanic[df_titanic['Survived'] == 1]['Fare'].mean()

48.39540760233917

**7. Kazadan kurtulan toplam kiÅŸi sayÄ±sÄ±nÄ± bulunuz.**

In [26]:
len(df_titanic[df_titanic['Survived'] == 1])

342

**8. 10 yaÅŸÄ±ndan kÃ¼Ã§Ã¼klerin bilet fiyatlarÄ±nÄ±n medyan deÄŸerini bulunuz.**

In [27]:
df_titanic[df_titanic['Age'] < 10]['Fare'].median()

27.0

**9. 1., 2. ve 3. sÄ±nÄ±f bilet fiyatlarÄ±nÄ±n ortalama ve medyanlarÄ±nÄ± karÅŸÄ±laÅŸtÄ±rÄ±nÄ±z.**

In [28]:
df_titanic.groupby('Pclass')['Fare'].agg(['mean', 'median'])

             mean   median
Pclass
1       84.154687  60.2875
2       20.662183  14.2500
3       13.675550   8.0500

**10. Kazada Ã¶len kadÄ±nlarÄ±n oranÄ± ile erkeklerin oranÄ±nÄ± karÅŸÄ±laÅŸtÄ±rÄ±nÄ±z.**

In [30]:
total_men = df_titanic[df_titanic['Sex'] == 'male']
total_women = df_titanic[df_titanic['Sex'] == 'female']

dead_men_ratio = len(total_men[total_men['Survived'] == 0]) / len(total_men)
dead_women_ratio = len(total_women[total_women['Survived'] == 0]) / len(total_women)

dead_men_ratio, dead_women_ratio

(0.8110918544194108, 0.25796178343949044)